app/controllers/urls_controller.rb

SELECT "urls".* FROM "urls"
---
  def index
    @url = Url.new
    @urls = Url.all

INSERT INTO "urls" ("created_at", "updated_at", "short_url", "original_url") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2021-05-13 23:09:50.313859"], ["updated_at", "2021-05-13 23:09:50.313859"], ["short_url", "8bac34"], ["original_url", "teste2"]]
---
  def create
    @url = Url.new(url_params)

    if @url.save

SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = $1 LIMIT $2  [["short_url", "76d4b0"], ["LIMIT", 1]]
---
  def show
    @url = Url.find_by_short_url(params[:url])